backend/artillery-heavy.yml
config:
  target: 'http://localhost:5000'
  phases:
    - duration: 180
      arrivalRate: 25
      rampTo: 75
    - duration: 300
      arrivalRate: 75
    - duration: 120
      arrivalRate: 75
      rampTo: 0
  defaults:
    headers:
      Content-Type: 'application/json'
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true

scenarios:
  - name: "Heavy Load Authentication"
    weight: 30
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "user@tradingapp.com"
            password: "password123"
          capture:
            - json: "$.token"
              as: "authToken"
      - get:
          url: "/api/auth/profile"
          headers:
            Authorization: "Bearer {{ authToken }}"

  - name: "Heavy Load Product Browsing"
    weight: 40
    flow:
      - get:
          url: "/api/products"
      - get:
          url: "/api/products/{{ $randomInt(1, 10) }}"
      - get:
          url: "/api/products/search?q=trading"

  - name: "Heavy Load Portfolio"
    weight: 30
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "user@tradingapp.com"
            password: "password123"
          capture:
            - json: "$.token"
              as: "authToken"
      - get:
          url: "/api/portfolio"
          headers:
            Authorization: "Bearer {{ authToken }}"
      - get:
          url: "/api/transactions/my"
          headers:
            Authorization: "Bearer {{ authToken }}"