backend/artillery-memory.yml
config:
  target: 'http://localhost:5000'
  phases:
    - duration: 600
      arrivalRate: 10
  defaults:
    headers:
      Content-Type: 'application/json'
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true

scenarios:
  - name: "Memory Leak Test - Auth"
    weight: 25
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "user@tradingapp.com"
            password: "password123"
          capture:
            - json: "$.token"
              as: "authToken"
      - get:
          url: "/api/auth/profile"
          headers:
            Authorization: "Bearer {{ authToken }}"

  - name: "Memory Leak Test - Products"
    weight: 25
    flow:
      - get:
          url: "/api/products"
      - get:
          url: "/api/products/{{ $randomInt(1, 10) }}"
      - get:
          url: "/api/products/search?q=trading"

  - name: "Memory Leak Test - Portfolio"
    weight: 25
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "user@tradingapp.com"
            password: "password123"
          capture:
            - json: "$.token"
              as: "authToken"
      - get:
          url: "/api/portfolio"
          headers:
            Authorization: "Bearer {{ authToken }}"
      - get:
          url: "/api/portfolio/summary"
          headers:
            Authorization: "Bearer {{ authToken }}"

  - name: "Memory Leak Test - Transactions"
    weight: 25
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "user@tradingapp.com"
            password: "password123"
          capture:
            - json: "$.token"
              as: "authToken"
      - get:
          url: "/api/transactions/my"
          headers:
            Authorization: "Bearer {{ authToken }}"