backend/artillery-stress.yml
config:
  target: 'http://localhost:5000'
  phases:
    - duration: 300
      arrivalRate: 50
      rampTo: 150
    - duration: 600
      arrivalRate: 150
    - duration: 300
      arrivalRate: 150
      rampTo: 0
  defaults:
    headers:
      Content-Type: 'application/json'
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true

scenarios:
  - name: "Stress Test Authentication"
    weight: 25
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "user@tradingapp.com"
            password: "password123"
          capture:
            - json: "$.token"
              as: "authToken"
      - get:
          url: "/api/auth/profile"
          headers:
            Authorization: "Bearer {{ authToken }}"

  - name: "Stress Test Products"
    weight: 35
    flow:
      - get:
          url: "/api/products"
      - get:
          url: "/api/products/{{ $randomInt(1, 10) }}"
      - get:
          url: "/api/products/search?q=trading"
      - get:
          url: "/api/products/search?q=fund"

  - name: "Stress Test Portfolio"
    weight: 25
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "user@tradingapp.com"
            password: "password123"
          capture:
            - json: "$.token"
              as: "authToken"
      - get:
          url: "/api/portfolio"
          headers:
            Authorization: "Bearer {{ authToken }}"
      - get:
          url: "/api/portfolio/summary"
          headers:
            Authorization: "Bearer {{ authToken }}"
      - get:
          url: "/api/transactions/my"
          headers:
            Authorization: "Bearer {{ authToken }}"

  - name: "Stress Test Transactions"
    weight: 15
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "user@tradingapp.com"
            password: "password123"
          capture:
            - json: "$.token"
              as: "authToken"
      - post:
          url: "/api/transactions/buy"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            productId: "{{ $randomInt(1, 10) }}"
            units: 1
            amount: 1000