backend/load-tests.yml
config:
  target: 'http://localhost:5000'
  phases:
    - duration: 300
      arrivalRate: 20
      rampTo: 50
    - duration: 600
      arrivalRate: 50
    - duration: 300
      arrivalRate: 50
      rampTo: 0
  defaults:
    headers:
      Content-Type: 'application/json'
      Authorization: 'Bearer test-token'
  plugins:
    publish-metrics:
      - type: 'datadog'
        host: 'datadog-agent'
        port: 8125
        prefix: 'trading_app.'
        tags:
          - 'env:test'
          - 'service:trading_app'

scenarios:
  - name: "High Load Authentication"
    weight: 40
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "user@tradingapp.com"
            password: "password123"
          capture:
            - json: "$.token"
              as: "authToken"
      - get:
          url: "/api/auth/profile"
          headers:
            Authorization: "Bearer {{ authToken }}"

  - name: "High Load Product Browsing"
    weight: 35
    flow:
      - get:
          url: "/api/products"
      - get:
          url: "/api/products/{{ $randomInt(1, 10) }}"
      - get:
          url: "/api/products/search?q=trading"

  - name: "High Load Portfolio Operations"
    weight: 25
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "user@tradingapp.com"
            password: "password123"
          capture:
            - json: "$.token"
              as: "authToken"
      - get:
          url: "/api/portfolio"
          headers:
            Authorization: "Bearer {{ authToken }}"
      - get:
          url: "/api/portfolio/summary"
          headers:
            Authorization: "Bearer {{ authToken }}"
      - get:
          url: "/api/transactions/my"
          headers:
            Authorization: "Bearer {{ authToken }}"

  - name: "Stress Test Transaction"
    weight: 10
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "user@tradingapp.com"
            password: "password123"
          capture:
            - json: "$.token"
              as: "authToken"
      - post:
          url: "/api/transactions/buy"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            productId: "{{ $randomInt(1, 10) }}"
            units: 1
            amount: 1000